app/controllers/pics_controller.rb

INSERT INTO "pics" ("img_src", "caption", "created_at", "updated_at", "setname", "img_width", "img_height") VALUES('http://media.ebaumsworld.com/mediaFiles/picture/883100/81314423.jpg', 'Whoa, there!', '2011-02-17 23:25:21', '2011-02-17 23:25:21', 'chicks', 450, 621)
---
	def save
		@pic=Pic.new(params[:pic])
    img_size = FastImage.size(@pic.img_src, :timeout => 5)
    if !img_size.nil?
      @pic.img_width = img_size[0]
      @pic.img_height = img_size[1]
    end
		@pic.save

SELECT * FROM "pics" WHERE ("pics"."setname" IS NULL)
SELECT * FROM "pics"
SELECT * FROM "pics" WHERE ("pics"."id" = 6)
---
	def show
    # Get the pics in the requested set
    @title = params[:setname]
    this_set = @title
		pics=Pic.find_all_by_setname(this_set)
    @pics_count = pics.length

    # If there are no pics in the set, use all pics in database
		if @pics_count == 0
			pics=Pic.find(:all)

SELECT * FROM "pics" WHERE ("pics"."id" = 7)
DELETE FROM "pics" WHERE "id" = 7
SELECT * FROM "pics" WHERE ("pics"."setname" = 'dog') LIMIT 1
---
	def delete
		delete_pic = Pic.find(params[:pic_id])
		delete_pic.destroy
		new_num = params[:pic_num].to_i
    new_num -= 1 if new_num > 0
    set_count = Pic.find_all_by_setname(params[:set_name]).length

SELECT * FROM "pics" WHERE ("pics"."setname" = 'chicks')
---
	def index
    @title = "Choose a picture set"
		@setnames= Pic.find( :all, :select => 'DISTINCT setname')

SELECT * FROM "pics" WHERE ("pics"."setname" = 'dog') LIMIT 1
SELECT * FROM "pics"
---
	def last
		@pics = Pic.find_all_by_setname(params[:setname])
		redirect_to "/show/#{params[:setname]}/#{@pics.length-1}"

SELECT * FROM "pics" WHERE ("pics"."setname" = 'chicks')
---
  def slideshow
    @title = "Slideshow"
    pic_set = Pic.find_all_by_setname(params[:setname])